#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shapeshed/asimo/runs/run-E2sBruQmaYfjwYJ5

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_canonical_user_id.this: Refreshing...
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_canonical_user_id.this: Refreshing...
module.s3-us-east-1["com.shapeshed.auster"].data.aws_canonical_user_id.this: Refreshing...
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_canonical_user_id.this: Refreshing...
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_canonical_user_id.this: Refreshing...
aws_acm_certificate.cert-www-shapeshed-com: Refreshing state... [id=arn:aws:acm:us-east-1:535487841971:certificate/bec48333-b864-4dd5-b546-d69f5331a10c]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.wozniak]
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_canonical_user_id.this: Refreshing...
aws_acm_certificate.cert-shapeshed-com: Refreshing state... [id=arn:aws:acm:us-east-1:535487841971:certificate/558d6912-425b-4002-8c7f-6a7fe9b9d408]
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.auster"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.cdn]
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.auster]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.orwell]
module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.bomberg]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.clearmatics]
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.auster"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.auster"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.clearmatics,private]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.orwell:general]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.cdn:general]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.clearmatics:general]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.wozniak:general]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.cdn,private]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.orwell,private]
module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.bomberg:general]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.auster:general]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.wozniak,private]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.auster,private]
module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.bomberg,private]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.auster]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.wozniak]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.clearmatics]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.orwell]
module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.bomberg]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.cdn]
module.s3-static-shapeshed-com.data.aws_canonical_user_id.this: Refreshing...
module.s3-eu-west-1["creative-corners"].data.aws_canonical_user_id.this: Refreshing...
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_canonical_user_id.this: Refreshing...
aws_route53_zone.shapeshed_com: Refreshing state... [id=Z0914809299OFXJQ90CQ9]
module.s3-eu-west-1["creative-corners"].aws_s3_bucket.this[0]: Refreshing state... [id=creative-corners]
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_caller_identity.current: Refreshing...
module.s3-eu-west-1["photos.shapeshed.com"].aws_s3_bucket.this[0]: Refreshing state... [id=photos.shapeshed.com]
module.s3-static-shapeshed-com.data.aws_caller_identity.current: Refreshing...
module.s3-eu-west-1["creative-corners"].data.aws_caller_identity.current: Refreshing...
aws_cloudfront_distribution.cf-www-shapeshed-com: Refreshing state... [id=EV5A8S0MFH6X4]
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-eu-west-1["creative-corners"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-static-shapeshed-com.data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-static-shapeshed-com.aws_s3_bucket.this[0]: Refreshing state... [id=static.shapeshed.com]
aws_cloudfront_distribution.cf-shapeshed-com: Refreshing state... [id=EOEO7HZP7EIIC]
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-eu-west-1["creative-corners"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-static-shapeshed-com.data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
aws_route53_record.__dmarc_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__dmarc.shapeshed.com_TXT]
aws_route53_record.finney_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_finney.shapeshed.com_A]
aws_route53_record.shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_A]
aws_route53_record.moxie__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie._domainkey.shapeshed.com_TXT]
aws_route53_record.smtp_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_smtp.shapeshed.com_CNAME]
aws_route53_record.mx01_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_A]
aws_route53_record.moxie_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_A]
aws_route53_record.mail_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mail.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_MX: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_MX]
aws_route53_record.__26eca8f67eb273a9cafb25ef1989fdf1_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_TXT]
aws_route53_record.mx02_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx02.shapeshed.com_A]
aws_route53_record.mx02_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx02.shapeshed.com_AAAA]
aws_route53_record.shgsbo4u9t_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shgsbo4u9t.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_SOA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_SOA]
aws_route53_record.imap_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_imap.shapeshed.com_CNAME]
aws_route53_record.moxie_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_AAAA]
aws_route53_record.mx01_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_AAAA]
aws_route53_record.d78e316caf6d1de59613b2e5a7e0d62b_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_d78e316caf6d1de59613b2e5a7e0d62b.shapeshed.com_CNAME]
aws_route53_record.shapeshed__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed._domainkey.shapeshed.com_TXT]
aws_route53_record.shapeshed_com_NS: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_NS]
aws_route53_record.__acme-challenge_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__acme-challenge.shapeshed.com_TXT]
aws_route53_record.__8e912589f272071e6beb0f31146b9819_www_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__8e912589f272071e6beb0f31146b9819.www.shapeshed.com_CNAME]
aws_route53_record.w6yzyrt6eyqt_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_w6yzyrt6eyqt.shapeshed.com_CNAME]
aws_route53_record.googlee87068e8125fba47_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_googlee87068e8125fba47.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_AAAA]
aws_route53_record.yandex-verification_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_yandex-verification.shapeshed.com_TXT]
aws_route53_record.finney_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_finney.shapeshed.com_AAAA]
module.s3-eu-west-1["creative-corners"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=creative-corners,private]
module.s3-eu-west-1["photos.shapeshed.com"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=photos.shapeshed.com,private]
module.s3-eu-west-1["creative-corners"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=creative-corners]
module.s3-eu-west-1["photos.shapeshed.com"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=photos.shapeshed.com]
module.s3-static-shapeshed-com.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=static.shapeshed.com]
module.s3-static-shapeshed-com.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=static.shapeshed.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate_validation.cert-shapeshed-com-validation will be created
  + resource "aws_acm_certificate_validation" "cert-shapeshed-com-validation" {
      + certificate_arn         = "arn:aws:acm:us-east-1:535487841971:certificate/558d6912-425b-4002-8c7f-6a7fe9b9d408"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.shapeshed_com_acm_validation["*.shapeshed.com"] will be created
  + resource "aws_route53_record" "shapeshed_com_acm_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com"
      + records         = [
          + "_ac0f44f6b20b6d08d8683d23e8f24bce.xrchbtpdjs.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z0914809299OFXJQ90CQ9"
    }

  # aws_route53_record.shapeshed_com_acm_validation["shapeshed.com"] will be created
  + resource "aws_route53_record" "shapeshed_com_acm_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com"
      + records         = [
          + "_ac0f44f6b20b6d08d8683d23e8f24bce.xrchbtpdjs.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z0914809299OFXJQ90CQ9"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @shapeshed, Action: `pull_request`*